[
  {
    "image": "./src/assets/image/image-0-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Desafio dos conselhos",
    "link": "https://desafio-conselho.vercel.app/",
    "description": "Desafio para criar a parte de front end de um site de Conselhos, utilizando o vue 3 e api. Site composto por um background linear, um botão que carrega um conselho caso seja clicado e uma animação de espera."
  },
  {
    "image": "./src/assets/image/image-1-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Escola Blueberry",
    "link": "https://escola-blueberry-vuetify.vercel.app/",
    "description": "Desafio para criar a parte de front end de um site escolar, utilizando o vue 3 e o vuetify 3. Site composto por um background retirado do site 'freepink', uma logo criada no aplicativo 'Canva', menu de busca, formularios e galeria exibindo imagens."
  },
  {
    "image": "./src/assets/image/image-3-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Desafio Letflix",
    "link": "https://desafio-letflix.vercel.app/",
    "description": "Desafio para criar a parte de front end de um site de filmes, utilizando o vue 3 e api. Site composto por filmes/series retirados de um api, uma logo criada no aplicativo 'Canva', menu de busca , com opção de encontrar o filme que deseja através do input, e uma seção que fica trazendo um filme aleatorio como sugestão."
  },
  {
    "image": "./src/assets/image/image-2-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Boutique Oliveira",
    "link": "https://boutique-oliveira.vercel.app/",
    "description": "Desafio para criar a parte de front end de uma loja virtual e utilizando o vue 3. Site composto por imagens retiradas da loja 'Shoppe', uma logo criada no aplicativo 'Canva', menu de busca, novidades que aparecem através de um slide de fotos, seções de vendas e seções com videos do aplicativo 'Youtube'"
  },
  {
    "image": "./src/assets/image/image-5-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Desafio Carnaval",
    "link": "https://desafio-carnaval.vercel.app/",
    "description": "Desafio para criar a parte de front end de um site de assuntos, com o tema de carnaval, utilizando o vue 3 e uma lista Json. Site composto por cards, formulario de busca, com opção de encontrar o card que deseja através do input."
  },
  {
    "image": "./src/assets/image/image-4-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Desafio Google",
    "link": "https://desafio-2-xi.vercel.app/",
    "description": "Desafio para criar a parte de front end de um site de pesquisa do Google, utilizando o JavaScript puro e uma lista Json para teste. Site composto por menu de busca, formulário que compara o valor recebido com a lista Json e caso a pessoa tenha o acesso, é redirecionada a uma outra página, sem a opção de voltar."
  },
  
  {
    "image": "./src/assets/image/image-6-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Questionario Game",
    "link": "https://questionario-tawny.vercel.app/",
    "description": "Desafio para criar a parte de front end de um questionário de jogos, utilizando o JavaScript puro e uma lista Json . Site composto por um formulário que compara o valor recebido com a lista Json, trazendo o nome do jogo e a opção de resposta. Abaixo temos um botão que verifica a pontuação do usuário, acertando ele ganha 1 ponto e em cada erro ele perde 1, ou seja, -1."
  },
  {
    "image": "./src/assets/image/image-7-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Valorant",
    "link": "https://valorant-xi.vercel.app/",
    "description": "Desafio para criar a parte de front end dos resultados do jogo Valorant, utilizando o Vue 3. Site composto por um header que encaminha o usuário a diferentes páginas, dependendo da imagem que ele clicar. As páginas são compostas por diversas animações e designs diferentes."
  },
  {
    "image": "./src/assets/image/image-8-project.png",
    "functionn": "Desenvolvedora Front-end",
    "title": "Hydra",
    "link": "https://hydra-seven.vercel.app/",
    "description": "Desafio para criar a parte de front end do site Hydra. Foi o meu primeiro desafio, então o objetivo dele era ter o conhecimento sobre as divisões do Html e do Css, utilizando divs, inputs e pequenas animações."
  }
]
